Белгипрозем_2017/src/BusinessProcesses/РешениеВопросовВыполненияЗадач/РешениеВопросовВыполненияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>РешениеВопросовВыполненияЗадач</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВопроса</name>
    <type>
      <types>EnumRef.ВидыВопросовВыполненияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторПроцесса</name>
    <comment>Пользователь, который инициировал процесс, при выполнении которого возник вопрос</comment>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьНаУточнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметРассмотрения</name>
    <comment>Задача исполнителя, при выполнении которой возник вопрос</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПрерывания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоеРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРезультатВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦиклыРассмотрения</name>
    <attributes>
      <name>Цикл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредметаОснование</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонОснование</name>
      <type>
        <types>CatalogRef.ШаблоныИсходящихДокументов</types>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
        <types>CatalogRef.ШаблоныВходящихДокументов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыЗадач</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>BusinessProcessRoutePointRef.РешениеВопросовВыполненияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноУдаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

Белгипрозем_2017/src/InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач/ПереносыСроковВыполненияПроцессовИЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереносыСроковВыполненияПроцессовИЗадач</name>
  <resources>
    <name>БизнесПроцессПереноса</name>
    <comment>Заявка, в рамках которой произведен перенос срока</comment>
    <type>
      <types>BusinessProcessRef.РешениеВопросовВыполненияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>Итерация</name>
    <comment>Номер итерации согласования заявки на перенос срока, в рамках которой произведен перенос</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомментарийАвтора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НовыйСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СтарыйСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаПереносаСрока</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/BusinessProcesses/РешениеВопросовВыполненияЗадач/Forms/ФормаПереносСрокаБизнесПроцесса/Module.bsl
&НаКлиенте
Процедура КоличествоПереносовСроковНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("БизнесПроцесс", БизнесПроцесс);
	ОткрытьФорму(
		"РегистрСведений.ПереносыСроковВыполненияПроцессовИЗадач.Форма.ФормаСпискаПоПроцессу", 
		ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСрок(Команда)
	
	// Проверка заполнения обязательных полей
	Отказ = Ложь;
	Если Элементы.ГруппаСроки.ТекущаяСтраница = Элементы.ГруппаСрокиДатами Тогда
		Если  НЕ ЗначениеЗаполнено(НовыйСрок) Тогда
			Текст = НСтр("ru = 'Поле ""Новый срок"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"НовыйСрок",
				,
				Отказ);
		КонецЕсли;
		Если СтарыйСрок = НовыйСрок Тогда
			Текст = НСтр("ru = 'Новый срок должен отличаться от старого.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"НовыйСрок",
				,
				Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ГруппаСроки.ТекущаяСтраница = Элементы.ГруппаСрокиПериодами Тогда
		Если  НЕ ЗначениеЗаполнено(НоваяДлительностьДни)
			И НЕ ЗначениеЗаполнено(НоваяДлительностьЧасы) Тогда
			Текст = НСтр("ru = 'Поле ""Новый срок"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"НоваяДлительностьДни",
				,
				Отказ);
		КонецЕсли;
		Если СтараяДлительностьДни * 24 + СтараяДлительностьЧасы = 
			НоваяДлительностьДни * 24 + НоваяДлительностьЧасы Тогда
			Текст = НСтр("ru = 'Новый срок должен отличаться от старого.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"НоваяДлительностьДни",
				,
				Отказ);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		Текст = НСтр("ru = 'Поле ""Комментарий"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			,
			"Комментарий",
			,
			Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ПереносСрока", Истина);
	ПараметрыОповещения.Вставить("БизнесПроцессПереноса", ЗаявкаНаПереносСрока);
	ПараметрыОповещения.Вставить("КомментарийАвтора", Комментарий);
	ПараметрыОповещения.Вставить("Пользователь", ТекущийПользователь);
	ПараметрыОповещения.Вставить("СтарыйСрок", СтарыйСрок);
	ПараметрыОповещения.Вставить("СтараяДлительностьДни", СтараяДлительностьДни);
	ПараметрыОповещения.Вставить("СтараяДлительностьЧасы", СтараяДлительностьЧасы);
	ПараметрыОповещения.Вставить("НовыйСрок", НовыйСрок);
	ПараметрыОповещения.Вставить("НоваяДлительностьДни", НоваяДлительностьДни);
	ПараметрыОповещения.Вставить("НоваяДлительностьЧасы", НоваяДлительностьЧасы);
	ПараметрыОповещения.Вставить("Предмет", БизнесПроцесс);
	Закрыть(ПараметрыОповещения);
	Оповестить("Процесс_ИзменениеСрока", ПараметрыОповещения);
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Перенос срока исполнения:'"),
		ПолучитьНавигационнуюСсылку(БизнесПроцесс),
		Строка(БизнесПроцесс),
		БиблиотекаКартинок.Информация32);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.БизнесПроцесс) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ЗаявкаНаПереносСрока", ЗаявкаНаПереносСрока);
	Параметры.Свойство("Идентификатор", ИдентификаторВызвавшейФормы);
	БизнесПроцесс = Параметры.БизнесПроцесс;
	
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", БизнесПроцесс);
	
	НаименованиеБизнесПроцессаГиперссылка = БизнесПроцесс.Наименование;
	
	Если БизнесПроцесс.Метаданные().Реквизиты.СрокИсполнения.Тип.СодержитТип(Тип("Число")) Тогда
		Элементы.ГруппаСроки.ТекущаяСтраница = Элементы.ГруппаСрокиПериодами;
		СтараяДлительностьДни = БизнесПроцесс.СрокИсполнения;
		СтараяДлительностьЧасы = БизнесПроцесс.СрокИсполненияЧас;
		НадписьСтарыйСрок = "";
		БизнесПроцессыИЗадачиКлиентСервер.ПолучитьСрокИсполненияПрописью(
			ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач"),
			НадписьСтарыйСрок,
			СтараяДлительностьДни,
			СтараяДлительностьЧасы);
		Элементы.ДекорацияСтарыйСрок.Заголовок = НадписьСтарыйСрок;
	Иначе
		Элементы.ГруппаСроки.ТекущаяСтраница = Элементы.ГруппаСрокиДатами;
		СтарыйСрок = БизнесПроцесс.Ссылка.СрокИсполнения;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач") Тогда
		Элементы.НовыйСрокВремя.Видимость = Ложь;
		Элементы.СтарыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.ЗадачиСрокИсполнения.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.ЗадачиСрокИсполнения.Ширина = 5;
		Элементы.НоваяДлительностьЧасы.Видимость = Ложь;
		Элементы.ДекорацияЧасов.Видимость = Ложь;
	КонецЕсли;
	
	ВывестиКоличествоПереносовПоПроцессу();
	ИспользоватьВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКоличествоПереносовПоПроцессу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ПереносыСроковВыполненияПроцессовИЗадач.Предмет) КАК Колво
		|ИЗ
		|	РегистрСведений.ПереносыСроковВыполненияПроцессовИЗадач КАК ПереносыСроковВыполненияПроцессовИЗадач
		|ГДЕ ПереносыСроковВыполненияПроцессовИЗадач.Предмет = &БизнесПроцесс";
		
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.Колво > 0 Тогда
		КоличествоПереносовСроков = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'История переносов (%1)'"), 
			Строка(Выборка.Колво));
		Возврат;
	КонецЕсли;
	
	Элементы.КоличествоПереносовСроков.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элементы.СписокЗадач.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	БизнесПроцессыИЗадачиКлиент.ОткрытьФормуВыполненияЗадачи(Элементы.СписокЗадач.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесПроцессНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, БизнесПроцесс);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйСрокДатаПриИзменении(Элемент)
	
	ПриИзмененииНовогоСрока(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйСрокВремяПриИзменении(Элемент)
	
	ПриИзмененииНовогоСрока(Ложь);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПриИзмененииНовогоСрока(ИзмененаДата)
	
	// Если в поле "Новый срок" вводится только время, то в дату проставляется текущая дата.
	// При вводе только времени дата автоматически принимает значение 01.01.0001 <Время>. Это значение исправляется.
	Если ЗначениеЗаполнено(НовыйСрок) и НовыйСрок < Дата(1,1,2) Тогда
		ДатаНачалаДня = НачалоДня(ТекущаяДата());
		ГодНачалаДня = Год(ДатаНачалаДня);
		МесяцНачалаДня = Месяц(ДатаНачалаДня);
		ДеньНачалаДня = День(ДатаНачалаДня);
		ЧасДаты = Час(НовыйСрок);
		МинутаДаты = Минута(НовыйСрок);
		СекундаДаты = Секунда(НовыйСрок);
		НовыйСрок = Дата(
			ГодНачалаДня,
			МесяцНачалаДня,
			ДеньНачалаДня,
			ЧасДаты,
			МинутаДаты,
			СекундаДаты);	
	КонецЕсли;
	Если ИзмененаДата И НовыйСрок < КонецДня(НовыйСрок)
		ИЛИ НЕ ИспользоватьВремяВСрокахЗадач Тогда
		НовыйСрок = КонецДня(НовыйСрок);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСрок) Тогда
		ДлительностьПереноса = 
			ПереносСроковВыполненияЗадач.ПолучитьПодписьДлительностьПереноса(
				ТекущийПользователь, 
				СтарыйСрок, 
				НовыйСрок);	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтарыйСрок) Тогда
		ДлительностьПереноса = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
